[
  {
    "title" : "This is an example of publishing a long article.",
    "date" : "2026-02-18T21:34:44Z",
    "id" : "1771450484",
    "body" : "ast November, Matthew Whitaker, the U.S. ambassador to NATO, startled a gathering of European officials at the Berlin Security Conference by remarking that he looked forward to the day when Germany would tell the United States, “We’re ready to take over the supreme allied commander position.” Despite Whitaker’s acknowledgment that such a moment was not imminent, his comments nonetheless shocked the audience of seasoned security officials who, like much of Washington, have long regarded NATO’s top military post as an American prerogative.\n\nWhitaker’s remark is indicative of a broader pattern of U.S. disengagement from the transatlantic alliance that has taken shape over the past year. Amid a sea of disruptions—territorial threats against Denmark, missed alliance meetings by senior U.S. diplomats, and planned personnel reductions at NATO installations—the Trump administration’s second-term approach to NATO is now coming into focus. Rather than openly abandoning the alliance, as some analysts feared, the United States appears to be “quiet quitting”: incrementally stepping away from the alliance it has led for close to eight decades. The White House seems to believe that only if the United States steps back will Europe finally be forced to step up.\n\nThe Trump administration may be intent on undoing decades of alliance leadership, but it will find that walking away from overseeing NATO’s military machinery is far harder than anticipated. NATO’s command structure was built around U.S. infrastructure and personnel, and no other member of the alliance is currently equipped to replace Washington. If Trump does choose to push ahead with his planned disengagement, the logistics of succession would be the least of the United States’ concerns. No major power has ever voluntarily surrendered control, much less command, of an alliance it built and led. Doing so at a moment of profound geopolitical upheaval would weaken the transatlantic partnership—and leave the United States less secure.\n\nUNDER NEW MANAGEMENT\nIt should come as no surprise that the second Trump administration is seeking changes to NATO. After publicly questioning Washington’s commitment to the alliance’s Article 5 collective defense pledge in his first term, Trump returned to the White House calling for member states to spend five percent of their GDP on defense and announcing plans to draw down the U.S. troop presence in Europe. But although Trump has long used the defense investment pledge as his preferred cudgel, his “America first” strategy has never been only about money. In addition to the president’s focus on a more equitable distribution of the financial burden, influential officials such as Elbridge Colby, the undersecretary of defense for policy, have pushed for Europe to assume greater operational responsibility within the alliance.\n\nSubscribe to Foreign Affairs This Week\nOur editors’ top picks, delivered free to your inbox every Friday.\n\nEnter your email here.\nSign Up \n* Note that when you provide your email address, the Foreign Affairs Privacy Policy and Terms of Use will apply to your newsletter subscription.\n\nEuropeans and transatlanticists spent an anxious summer bracing for Trump to make good on this vision. But after backlash from senior congressional Republicans in response to the Pentagon’s decision to discontinue a rotational U.S. brigade in Romania in October, the administration has paused work on the Global Posture Review and abandoned the idea of a large-scale U.S. troop drawdown from the continent. After Congress prohibited the administration from reducing troop numbers in Europe below 76,000 in December, Trump appears to be trying a new tack, albeit one that ultimately advances the same goal of reducing Washington’s role in Europe’s security.\n\nBy relinquishing command of the operational-level headquarters, known as Joint Force Commands, responsible for planning and conducting NATO operations, and declining to backfill U.S. service positions at other NATO installations as they come up for renewal, Washington is actively reducing its practical control of the alliance. The administration may no longer be targeting U.S. frontline troops for removal but is instead removing U.S. personnel slots, known as billets, at NATO installations, including at SHAPE, the alliance’s senior military command headquarters in Belgium. By not staffing key functions and thereby hollowing out the U.S. presence within NATO institutions, Washington would be effectively retreating from day-to-day alliance management. Such a pullback could prove even more consequential than withdrawing a brigade or two from Europe.\n\nYet in seeking to refashion NATO’s military infrastructure, the Trump administration will run headlong into the dilemma that has confronted alliance leaders for centuries: how to retain control while shedding responsibilities. Trump may believe that the strategic freedom gained by shedding NATO commitments is worth abdicating Washington’s traditional leadership role, but the historical record indicates otherwise. The value of the leverage, goodwill, and military reach accrued by alliance leaders far exceeds the costs of their obligations to other members.\n\nREDUCTIONS IN FORCE\nWhitaker’s controversial remarks came months after NBC News reported that the Trump administration was exploring surrendering the position of supreme allied commander for Europe, first held by U.S. General Dwight Eisenhower, after 75 years of uninterrupted U.S. stewardship. The revelation prompted a rare public rebuke from Alabama Representative Mike Rogers and Mississippi Senator Roger Wicker, the Republican chairs of the House and Senate Armed Services Committees, respectively, who warned that altering NATO’s command structure would jeopardize U.S. national security. When Trump ultimately nominated Lieutenant General Alexus Grynkewich for the position three months later, supporters of the transatlantic alliance in Washington and Brussels breathed a sigh of relief. Many believed the crisis over NATO’s military command structure had passed. They were wrong.\n\nAccording to Reuters, the Trump administration has continued to press behind the scenes for reforms to NATO’s integrated military command structure, the alliance’s operational nerve center. In tandem with reducing the U.S. troop presence on the continent, the administration is preparing to have the United States step back from leading NATO’s force-generation and defense-planning processes, as part of a broader vision for a European-led NATO command structure by 2027. Earlier this month, Politico reported on the latest (although likely not the last) shift in U.S. operational control: Washington will turn over operational command of the two remaining U.S.-led Allied Joint Force Command posts in Norfolk, Virginia, and Naples, Italy, to European commanders. Within a few years, all three NATO operational-level commands will have European leaders, yet another step toward realizing the Trump administration’s vision.\n\nAlthough the administration is not, for now, planning to relinquish the supreme allied commander position, these reforms create dynamics that would make such a change at the top increasingly likely over time. The reason is straightforward: in military alliances, billets follow forces. In 1815, for example, the Duke of Wellington commanded the coalition that defeated Napoleon at Waterloo because the United Kingdom fielded the largest contingent. In Afghanistan, once the United States became the largest troop-contributing nation in the NATO-led International Security Assistance Force in late summer 2006, U.S. Army General Dan McNeill replaced the British commander of the assistance force a few months later. The relationship between coalition leadership and weight of contribution remains an enduring military principle.\n\nIn the case of NATO, it is not only the top military post that Washington has traditionally held. The United States occupies approximately a quarter of the 1,000 or so billets at SHAPE, more than any other country. In addition to the responsibilities of the supreme allied commander, in charge of all NATO forces, U.S. officers and staff perform most of the core functional roles at the alliance’s military headquarters, including preparing regional and theater campaign plans, assigning and reviewing national capability targets, and other key deterrence and defense tasks.\n\nFor years, successive U.S. administrations from both parties have concluded that the advantages of being first among equals within NATO and retaining overreaching authority for military planning and operations outweigh the costs of underwriting Europe’s defense. Yet Trump, as he made clear at the annual meeting of the World Economic Forum at Davos in January, is convinced that the United States has “never gotten anything” from its allies across the Atlantic. His administration has come to believe that the United States is better off going it alone. Overturning the established order, however, will prove difficult. If successful, it will also ultimately weaken U.S. national security.\n\nWITHDRAWAL SYMPTOMS\nWith around 80,000 personnel on the continent, the United States no longer fields the largest national force in Europe. The standing armed forces of several European NATO allies, including France, Italy, and Poland, now dwarf the U.S. troop presence. But even as it has ceded its leading role providing conventional forces, Washington continues to contribute more than any other country to NATO’s destructive capacity. As the largest nuclear power in NATO, it has provided extended deterrence to members since the alliance’s earliest days. That strategic commitment, rather than the sheer number of deployed troops, has underpinned the United States’ outsize role in alliance military planning. If the Trump administration gets its way, that commitment could be in jeopardy, too.\n\nThe administration’s plans to reform NATO’s command structure by having Europeans take over key planning processes and billets could revive the idea, broadly unpopular outside Washington, of dividing conventional and nuclear duties between Europe, which would provide the bulk of the conventional forces for the alliance’s defense, and the United States, whose nuclear arsenal would serve as a final security guarantor. The idea gained traction among U.S. officials during the Cold War as a way to keep costs down but ultimately proved unworkable once it became clear that the defense of the Western bloc depended on sustained U.S. presence and deterrence. It would be no more viable today, when the credibility of collective defense against the alliance’s adversaries is as fragile as ever.\n\nFor years, Washington’s allies and adversaries have understood that U.S. forces stationed in Europe serve multiple purposes: reassurance, deterrence, and defense. Allies rightly fear that any drawdown risks signaling a diminished U.S. commitment to Europe’s security and invites adversaries to test the waters. A conventional-nuclear split, in which Washington continued to provide nuclear deterrence but left Europe to supply its own troops and weapons, for example, would play directly into Russia’s efforts to pry the United States from Europe by mounting conventional challenges that fall below the threshold for nuclear retaliation.\n\nThe reforms under consideration by the Trump administration would only encourage further attempts to destabilize the continent. In fact, tampering with the planning teams at SHAPE could be more damaging than a troop drawdown, since the absence of U.S. planners would make it harder for Washington to control escalation. Because the Pentagon will not commit American forces to any NATO operations it has not had a hand in forming, any move by the administration to sideline U.S. planners would create a bottleneck for future NATO missions.\n\nEven if the Trump administration has not yet grasped the strategic implications of its planned reforms, European allies have. They are likely to struggle to fulfill any Pentagon effort to offload SHAPE billets onto them. Europe’s armed forces are already stretched thin after decades of underinvestment, with the armed forces of several countries, including Germany, scrambling to find enough officers to train new conscripts and recruits. Expecting these depleted militaries to produce hundreds of experienced senior officers to assume planning duties now performed by U.S. officers in the next two years is simply unrealistic; the backbenches are all but bare.\n\nEASIER SAID THAN DONE\nOffloading many of SHAPE’s defense planning responsibilities to non-American officers would carry profound strategic, operational, and tactical implications for the alliance—and for the United States itself. A non-American supreme allied commander would mean a non-American issuing operational orders to U.S. officers in a European contingency, an arrangement the Pentagon has long regarded as a nonstarter. Indeed, reluctance to surrender operational control was a principal reason Secretary of Defense Donald Rumsfeld and his team opposed NATO’s intervention in Afghanistan in 2001; as one U.S. official put it at the time, “No one is going to tell us where we can or can’t bomb.” It is also one of the reasons why Congress reacted so sharply last March, when talk of relinquishing the supreme allied commander post first surfaced. In December, House Republicans released the National Defense Authorization Act, which seeks to prohibit the use of funds on efforts to relinquish the role of the commander by mandating a risk assessment by the U.S. military first.\n\nTrump may not see the United States’ and Europe’s defense as intimately linked in the ways his predecessors have, but reforming NATO’s command structure along the lines envisioned by the administration would run counter to U.S. security interests far beyond Europe, as well. The supreme allied commander for Europe has traditionally held the position of commander of the U.S. European Command simultaneously. This arrangement allows the supreme allied commander to immediately commit American forces—in the U.S. chain of command—to NATO, an especially important advantage when the United States conducts missions in other theaters that require access to refueling facilities and assets located in Europe. During Operation Midnight Hammer last June, for instance, U.S. forces relied on logistics assets based in Europe to strike Iran’s deeply buried nuclear facilities with “bunker buster” bombs. Were Washington to eventually relinquish the supreme allied commander slot, operations like Midnight Hammer would become significantly harder to pull off, since the U.S. government is unlikely to share sensitive intelligence with a non-American commander or even a SHAPE headquarters where non-Americans occupy key planning and operational nodes.\n\nEven if the Trump administration were to judge that losing access to allied facilities was an acceptable price to pay for reduced responsibility, it may find transferring leadership much harder than it imagines. The U.S.–South Korean military alliance offers an instructive example of the difficulties of relinquishing control in exchange for a lighter military burden. Established in 1978, the Combined Forces Command was conceived as a transitional command arrangement that would be helmed at first by a U.S. general before a South Korean four-star general would eventually assume command, with a U.S. deputy. Nearly five decades later, the command remains largely intact, still with U.S. leadership. Although plans to transfer operational control have been advanced intermittently, the persistence of this command architecture underscores how difficult it is to shed responsibilities without surrendering control. Shifting the United States from a leadership role to a supporting one in an alliance of 31 other members will be infinitely harder.\n\nLAW OF UNINTENDED CONSEQUENCES\nIt has become fashionable among some U.S. defense officials to describe plans for a reduced American role in NATO as a cultural shift from “one plus 31” to “one of 32.” Europeans and Canadians, the idea goes, must get comfortable treating the United States as merely another ally rather than the alliance’s leader.\n\nThe Trump administration, however, does not seem to appreciate the unavoidable tradeoff that would accompany such a shift. By shrinking its share of the burden, Washington would inevitably also shrink the scope of its control of NATO. Even if the administration is willing to sacrifice that control to finally rid itself of the demands of managing allies it views as constraining the United States, abandoning the leadership post—and all the advantages that come with it—would in fact limit the freedom to operate, unconstrained, on the global stage that the administration claims to so highly value.\n\nThe United States may not be withdrawing outright from NATO. But its quiet disengagement from its role as alliance manager, honed over decades to the shared benefit of Washington and Europe, will close the book on nearly a century of productive partnership, permanently weakening the United States in the process."
  },
  {
    "title" : "Waterfalls",
    "date" : "2026-02-18T21:27:10Z",
    "id" : "1771450021",
    "image" : "assets\/images\/1771450021.jpg"
  },
  {
    "date" : "2026-02-18T21:12:50Z",
    "body" : "In this stream we're going to build a website in Swift, using a free, open-source framework I produced called Ignite. It's designed to be familiar for SwiftUI developers, so hopefully you can see the appeal!",
    "id" : "1771449170",
    "title" : "Wohoooooooo"
  },
  {
    "date" : "2026-02-18T20:47:40Z",
    "body" : "Oat is an ultra-lightweight HTML + CSS, semantic UI component library with zero dependencies. No framework, build, or dev complexity. Just include the tiny CSS and JS files and you are good to go building decent looking web applications with most commonly needed components and elements.",
    "id" : "1771447660"
  },
  {
    "date" : "2026-02-18T20:41:30Z",
    "id" : "1771447290",
    "body" : "Heiyoooo"
  },
  {
    "image" : "assets\/images\/1771446970.jpg",
    "body" : "This is a post",
    "id" : "1771446970",
    "date" : "2026-02-18T20:36:26Z"
  },
  {
    "image" : "assets\/images\/1771446530.jpg",
    "id" : "1771446530",
    "date" : "2026-02-18T20:29:04Z"
  },
  {
    "date" : "2026-02-18T20:27:59Z",
    "body" : "Tip top",
    "id" : "1771446478"
  }
]